Repository: loloof64/Basic-chess-endgames
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# appTitle
source: Basic chess endgames
es: Finales básicos de ajedrez
fr: Finales d'échecs basiques

# buttonOk
source: Ok
es: De acuerdo
fr: D'accord

# buttonCancel
source: Cancel
es: Anular
fr: Annuler

# buttonAccept
source: Accept
es: Aceptar
fr: Accepter

# buttonDeny
source: Deny
es: Rechazar
fr: Refuser

# homeTitle
source: Home
es: Inicio
fr: Accueil

# home_failedLoadingExercise
source: Failed to load exercise : the chess position is not valid.
es: No se pudo cargar el ejercicio: la posición de ajedrez no es válida.
fr: Echec de chargement de l'exerice : la position d'échecs est invalide.

# home_failedGeneratingPosition
source: Failed to generate the position.
es: Falló al generar la posición.
fr: Echec de génération de la position.

# rgpdText
source: By using this app, you agree with :
es: Al utilizar esta aplicación, estás de acuerdo con:
fr: En utilisant cette application, vous vous conformez à :

# rgpdPrivacy
source: the Privacy Policy
es: la Política de Privacidad
fr: la Politique de Confidentialité

# rgpdUseConditions
source: the Use Conditions
es: Las Condiciones de Uso
fr: les Conditions d'Utilisation

# gamePageTitle
source: Game page
es: Página del juego
fr: Page de jeu

# gamePage_goalWin
source: Goal: win
es: Objetivo: ganar
fr: Objectif: victoire

# gamePage_goalDraw
source: Goal: draw
es: Objetivo: empate
fr: Objectif: nulle

# gamePage_newGame_title
source: Start a new game ?
es: ¿Reiniciar el juego?
fr: Nouvelle partie ?

# gamePage_newGame_message
source: Do you want to leave current game and start a new one ?
es: ¿Quieres reiniciar el juego?
fr: Souhaitez-vous abandonner la partie en cours et commencer une nouvelle ?

# gamePage_stopGame_title
source: Stop current game ?
es: ¿Detener el juego actual?
fr: Arrêter la partie ?

# gamePage_stopGame_message
source: Do you want to stop current game ?
es: ¿Quiere detener el juego actual?
fr: Souhaitez-vous arrêter la partie en cours ?

# gamePage_gameStopped
source: Game stopped.
es: Juego detenido.
fr: Partie interrompue.

# gamePage_checkmate_white
source: White has won by checkmate.
es: Los Blancos han ganado por jaque mate.
fr: Les Blancs ont gagné par échec et mat.

# gamePage_checkmate_black
source: Black has won by checkmate.
es: Los Negros han ganado por jaque mate.
fr: Les Noirs ont gagné par échec et mat.

# gamePage_stalemate
source: Stalemate.
es: Empate.
fr: Pat.

# gamePage_threeFoldRepetition
source: Draw by three-fold repetition.
es: Igualdad por repetición triple.
fr: Nulle par triple répétition.

# gamePage_missingMaterial
source: Draw by missing material.
es: Igualdad por falta de material.
fr: Nulle par manque de matériel.

# gamePage_fiftyMovesRule
source: Draw by the 50 moves rule.
es: Igualdad por la regla de los 50 movimientos.
fr: Nulle par la règle des 50 coups.

# gamePage_beforeExitTitle
source: Cancel current game ?
es: ¿Cancelar el juego actual?
fr: Annuler la partie courante ?

# gamePage_beforeExitMessage
source: Do you want to leave this page and cancel current game ?
es: ¿Quieres abandonar esta página y cancelar el juego actual?
fr: Souhaitez-vous abandonner cette partie et revenir à la page précédente ?

# scriptParser_variableNotAffected
source: The variable {name} has been used before having been defined.
es: La variable {name} se ha utilizado antes de haber sido definida.
fr: La variable {name} a été utilisée avant même d'avoir été définie.

# scriptParser_unrecognizedSymbol
source: Unrecognized symbol {symbol}.
es: Símbolo no reconocido {symbol}.
fr: Symbol non reconnu {symbol}.

# scriptParser_inputMismatch
source: Bad input at line {line}: character number {index}. You should have set {expected} but I got {received}.
es: Entrada incorrecta en la línea {line}: carácter número {index}. Deberías haber establecido {expected} pero obtuve {received}.
fr: Entrée incorrecte dans la ligne {line} : caractère à l'index {index}. Vous auriez dû mettre {expected} mais j'ai reçu {received}.

# scriptParser_noViableAltException
source: The input {input} does not match any rule. (Line {line}, character number {index})
es: La entrada {input} no coincide con ninguna regla. (Línea {line}, número de carácter {index})
fr: L'entrée {input} ne correspond à aucune règle. (Ligne {line}, numéro de caractère {index})

# scriptParser_miscParseError
source: Miscellaneous parsing error.
es: Error de análisis variado.
fr: Erreur d'interprétation diverse.

# scriptParser_noAntlr4Token
source: [No occurence]
es: [Sin ocurrencia]
fr: [Aucune occurence]

# scriptParser_eof
source: [EndOfFile]
es: [FinDeArchivo]
fr: [FinDeFichier]

# scriptParser_overridingPredefinedVariable
source: You try to change the value of predefined variable {name}.
es: Intentas cambiar el valor de la variable predefinida {name}.
fr: Vous essayez de modifier la valeur de la variable prédéfinie {name}.

# scriptParser_parseErrorDialogTitle
source: Script error for {name}
es: Error de script para {name}
fr: Erreur de script pour {name}

# scriptParser_typeError
source: Please check that you don't use int value instead of boolean value and vice versa.
es: Por favor, compruebe que no utiliza un valor int en lugar de un valor booleano y viceversa.
fr: Veuillez vérifier que vous n'utilisez pas de valeur entière à la place de valeur booléenne, et vice versa.

# scriptParser_missingScriptType
source: Failed to generate position : please check that all of the script sections declares a correct script type.
es: No se pudo generar la posición: compruebe que todas las secciones del script declaran un tipo de script correcto.
fr: Echec de génération de la position: veuillez vérifier que toutes les sections du script déclarent un type de script correct.

# scriptParser_miscErrorDialogTitle
source: Global error
es: Equivocado global
fr: Erreur globale

# sampleScript_kqK
source: King + Queen Vs King
es: Rey + Reina Vs Rey
fr: Roi + Dame Contre Roi

# sampleScript_krK
source: King + Rook Vs King
es: Rey + Torre Vs Rey
fr: Roi + Tour Contre Roi

# sampleScript_krrK
source: King + 2 Rooks Vs King
es: Rey + 2 Torres Vs Rey
fr: Roi + 2 Tours Contre Roi

# sampleScript_kbbK
source: King + Rook Vs King
es: Rey + 2 Alfiles Vs Rey
fr: Roi + 2 Fous Contre Roi

# sampleScript_kpK1
source: King + Pawn Vs King (1)
es: Rey + Peón Vs Rey (1)
fr: Roi + Pion Contre Roi (1)

# sampleScript_kpK2
source: King + Pawn Vs King (2)
es: Rey + Peón Vs Rey (2)
fr: Roi + Pion Contre Roi (2)

# sampleScript_kpppK
source: King + 3 Pawns Vs King
fr: Roi + 3 Pions Contre Roi
